<img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/RiskAnalysisV.svg" /> 
<table>

<thead>

<tr>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder</th>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.png" /> High</td>

<td>AWS</td>

<td>tf-test-1</td>

<td>Auto01</td>

<td>Administrative port 22 (ssh) open to more than 256 IPs from the Internet</td>

</tr>
<tr>

<td><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.png" /> Low</td>

<td>AWS</td>

<td>tf-test-1</td>

<td>Auto02</td>

<td>Administrative port 100 is also very risky</td>

</tr>
<tr>

<td><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.png" /> Low</td>

<td>AWS</td>

<td>tf-test-1</td>

<td>Auto06</td>

<td>And Test</td>

</tr>
                 
</tbody>
</table>
<details>
<summary>Risks Report | tf-test-1</summary>

<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/high.png" />  Auto01 | Administrative port 22 (ssh) open to more than 256 IPs from the Internet</summary> 

### **Description:**
Your cloud estate is accessible from more than 256 IP addresses using the SSH service (TCP/22).  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from many public IP addresses is risky.


### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**

```

[
	{
		"toPort": 8082,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": [
			2887712768,
			2887778303
		]
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.png" />  Auto02 | Administrative port 100 is also very risky</summary> 

### **Description:**
some very special description

### **Recommendation:**
Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access 

### **Details:**

```

[
	{
		"toPort": 8082,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": [
			2887712768,
			2887778303
		]
	}
]

```

</details>
<details>

<summary><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/low.png" />  Auto06 | And Test</summary> 

### **Description:**
Automation Desc

### **Recommendation:**
Auto recommendation

### **Details:**

```

[
	{
		"toPort": 8082,
		"fromPort": 0,
		"ipProtocol": "tcp",
		"ipRange": [
			2887712768,
			2887778303
		]
	}
]

```

</details>


<details>
<summary>Logs</summary>
<br>Output<br>

```

[
	{
		"riskTitle": "Administrative port 22 (ssh) open to more than 256 IPs from the Internet",
		"riskSeverity": "high",
		"riskDescription": "Your cloud estate is accessible from more than 256 IP addresses using the SSH service (TCP/22).  SSH is a remote-login service that allows command-line access to Linux/Unix-based servers and is generally used for server administration. Allowing administrative access from many public IP addresses is risky.\n",
		"riskRecommendation": "Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access ",
		"riskId": "Auto01",
		"items": [
			{
				"toPort": 8082,
				"fromPort": 0,
				"ipProtocol": "tcp",
				"ipRange": [
					2887712768,
					2887778303
				]
			}
		]
	},
	{
		"riskTitle": "Administrative port 100 is also very risky",
		"riskSeverity": "low",
		"riskDescription": "some very special description",
		"riskRecommendation": "Restrict the rules to refer to only the source IPs you really use, and limit the number of public IP addresses that have this administrative access ",
		"riskId": "Auto02",
		"items": [
			{
				"toPort": 8082,
				"fromPort": 0,
				"ipProtocol": "tcp",
				"ipRange": [
					2887712768,
					2887778303
				]
			}
		]
	},
	{
		"riskTitle": "And Test",
		"riskSeverity": "low",
		"riskDescription": "Automation Desc",
		"riskRecommendation": "Auto recommendation",
		"riskId": "Auto06",
		"items": [
			{
				"toPort": 8082,
				"fromPort": 0,
				"ipProtocol": "tcp",
				"ipRange": [
					2887712768,
					2887778303
				]
			}
		]
	}
]

```

</details>


<img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/TerraformV.svg" />

<details>
<summary>Terraform Log</summary>
<br>Output<br>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.cloudfront_distribution will be created
  + resource "aws_cloudfront_distribution" "cloudfront_distribution" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = (known after apply)
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 3600
          + max_ttl                = 86400
          + min_ttl                = 0
          + target_origin_id       = "this-is-a-test"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + logging_config {
          + include_cookies = false
          + prefix          = "logs"
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "this-is-a-test"
          + origin_id           = "this-is-a-test/cloudflow"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_security_group.devsecops_test will be created
  + resource "aws_security_group" "devsecops_test" {
      + arn                    = (known after apply)
      + description            = "Display devsecops "
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.20.30.0/24",
                ]
              + description      = ""
              + from_port        = 7654
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 7655
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + description      = "web app"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8082
            },
        ]
      + name                   = "devsecops_test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "cool_application"
        }
      + tags_all               = {
          + "Name" = "cool_application"
        }
      + vpc_id                 = "vpc-12345678"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_ALGOSEC_CODE_ANALYSIS/tf-test-1\tmp\tf-tf-test-1.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example_ALGOSEC_CODE_ANALYSIS/tf-test-1\\tmp\\tf-tf-test-1.out"


```

Errors

```



```

</details> <!-- End Format Logs -->

</details><br>


*Pusher: @alonnalgo, Action: `pull_request`, Working Directory: '/home/runner/work/risk-analysis-customer-repo-example/risk-analysis-customer-repo-example', Workflow: 'Customer Repo CI/CD'*